app/ws/MA_WS/App_Data/struval/7.8-csv.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://xmlns.ec.eu/BusinessActivityService/StruvalBAS/V3" xmlns:v31="http://xmlns.ec.eu/BusinessObjects/StruvalDS/V3/">
  <soapenv:Header/>
  <soapenv:Body>
    <v3:ValidateData>
      <!--Optional:-->
      <Input>
        <v31:InputFile>cid:{{inputCid}}</v31:InputFile>
        <!--Optional:-->
        <v31:InputConfig>
          <!--Zero or more repetitions:-->
          <v31:Config type="parameters">
            <!--Optional:-->
            <v31:configFile>cid:{{configCid}}</v31:configFile>
          </v31:Config>
        </v31:InputConfig>
      </Input>
      <!--Optional:-->
      <StructureConfig>
        <!--You have a CHOICE of the next 2 items at this level-->
        <v31:Structure agency="{{agency}}" id="{{id}}" version="{{version}}">
          <v31:StructureFile>cid:{{structureCid}}</v31:StructureFile>
        </v31:Structure>
        <v31:IsDataFlow>true</v31:IsDataFlow>
      </StructureConfig>
      <MaximumErrorNumber>{{maxErrors}}</MaximumErrorNumber>
    </v3:ValidateData>
  </soapenv:Body>
</soapenv:Envelope>